tests/webhook-test.yml
config:
  target: 'https://omnicentertest.contactvox.com'
  tls:
    rejectUnauthorized: false
  phases:
    - duration: 60
      arrivalRate: 10
  payload:
    path: './payload4.csv'
    fields:
      - empresa
      - messages_body
      - author
      - chatId
      - senderName
      - instanceId
    order: sequence
    skipHeader: true

scenarios:
  - name: 'Asesor enviando mensaje'
    engine: 'http'
    flow:
      - think: '{{ $randomNumber(5,30) }}'
      - post:
          url: '/{{ empresa }}/chatapi'
          json:
            messages:
              - id: '{{ $uuid }}'
                body: '{{ messages_body }}'
                fromMe: false
                self: 0
                isForwarded: false
                author: '{{ author }}'
                time: '{{ $timestamp }}'
                chatId: '{{ chatId }}'
                type: 'chat'
                senderName: '{{ senderName }}'
                caption: null
                quotedMsgId: null
                chatName: '{{ chatId }}'
            instanceId: '{{ instanceId }}'